#Задача номер 3

N = int(input('Введите число: '))
count = 1
dvoika = 1
while count <= N:
    dvoika = dvoika * 2
    count += 1
print(dvoika)